[{"Entry":"1","Type":"Conference","Start Date":"2025-08-28T00:00:00.000Z","End Date":"2025-08-29T00:00:00.000Z","Title":"Variety in Chemistry Education / Physics Higher Education Conference (ViCEPHEC)","Description":"Variety in Chemistry Education/Physics Higher Education Conference is the UK's leading annual conference for education in the Physical Sciences. Affilliated with both the Institute of Physics and the Royal Society of Chemistry, it is a space for educators to come together as a community and discuss current challenges and share exciting practice.\n​\nThis year's conference in Liverpool will build on the tremendous success of ViCEPHEC24 by exploring the theme of Future Directions in teaching alongside the traditional programme of professional talks, workshops, and panels. We invite submissions from practitioners, scholars, and researchers focused on higher education and outreach.\n\nMain topics include but not limited to: Future Directions in teaching and learning, Case studies of teaching design and delivery, Sustainability, Discipline-related education, Science communication and outreach, among others.","URL":"https://vicephec2025.weebly.com/","Location_Country":"UK","Location_City":"Liverpool","Location_Instiution":"University of Liverpool","Registration Deadline":"2025-07-02T00:00:00.000Z","Mode":"In-person"},{"Entry":"2","Type":"Conference","Start Date":"2025-09-10T00:00:00.000Z","End Date":"2025-09-10T00:00:00.000Z","Title":"Supporting Neuroinclusion in the Chemical Sciences","Description":"The Department of Chemistry at the University of York invites you to join us for our Annual EDI Beacon Symposium for 2025. This year the symposium will bring together a range of individuals with interests in the development and implementation of neuroinclusive practice in the chemical sciences. This includes both academia and industry and activities with teaching and research focuses, in addition to professional support services.","URL":"https://www.york.ac.uk/chemistry/about/events/2025/edi-symposium-neuroinclusion/","Location_Country":"UK","Location_City":"York","Location_Instiution":"University of York","Registration Deadline":"2025-08-15T00:00:00.000Z","Mode":"Hybrid"},{"Entry":"3","Type":"Workshop","Start Date":"2025-07-21T00:00:00.000Z","End Date":"2025-07-21T00:00:00.000Z","Title":"(Gen)AI in Chemistry Education Workshop","Description":"This workshop is being run by the AIchemy Hub, in association with the teaching team from Imperial College Department of Chemistry. We will explore how (Gen)AI is starting to change the landscape of undergraduate chemistry education, and discuss its applications in chemistry teaching, alongside the benefits and challenges associated with its use.  \n\nWhile some Chemistry departments have been early adopters in using (Gen)AI in chemistry teaching, we are aware of others that are yet to incorporate (Gen)AI into their curriculum. This workshop will therefore provide case study examples while also providing opportunities for wider discussion on the topic. ","URL":"https://aichemy.ac.uk/event/genai-in-chemistry-education-workshop/","Location_Country":"UK","Location_City":"London","Location_Instiution":"Imperial College London","Registration Deadline":"2025-06-06T00:00:00.000Z","Mode":"In-person"},{"Entry":"4","Type":"Conference","Start Date":"2025-07-02T00:00:00.000Z","End Date":"2025-07-04T00:00:00.000Z","Title":"11th European Variety in University Chemistry Education Conference (EuroVariety 2025)","Description":"","URL":"https://eurovariety2025.confer.uj.edu.pl/","Location_Country":"Poland","Location_City":"Krakow","Location_Instiution":"Jagiellonian University","Registration Deadline":"2025-06-13T00:00:00.000Z","Mode":"In-person"},{"Entry":"5","Type":"Conference","Start Date":"2026-07-13T00:00:00.000Z","End Date":"2026-07-17T00:00:00.000Z","Title":"28th International Conference on Chemistry Education & 17th European Conference on Research in Chemical Education","Description":"Chemistry education is a field concerned with teaching and learning of chemistry. The content of Chemistry education research (CER) ranges from understanding the history and philosophy of chemistry, which guides on us how chemistry knowledge was developed, to the application of emerging technologies and tools for more effective teaching and learning of chemistry. CER has grown as a field substantially over the past 60 years but is still a relatively young subdiscipline of chemistry. Although substantial progress has been made in identifying evidence-based strategies to support the teaching and learning of chemistry, we have yet to realize widespread systemic change regarding how chemistry is taught at the secondary school and tertiary levels. Connecting chemistry educators at the secondary education level with chemistry education researchers in academia has never been more vitally needed, and yet these groups are still frustratingly divided.","URL":"https://iccecrice2026.org/","Location_Country":"Türkiye","Location_City":"Erzurum","Location_Instiution":"ICCE & ECRICE","Registration Deadline":"2026-03-29T00:00:00.000Z","Mode":"In-person"},{"Entry":"6","Type":"Conference","Start Date":"2026-07-26T00:00:00.000Z","End Date":"2026-07-30T00:00:00.000Z","Title":"Biennial Conference on Chemical Education (BCCE)","Description":"The Biennial Conference on Chemical Education (BCCE) is a meeting sponsored by the Division of Chemical Education (DivCHED) of the American Chemical Society (ACS). The conference welcomes chemistry educators from around the globe and who operate in all education sectors (academia/government/industry) and levels (primary, secondary, two-year and four-year undergraduate, and graduate/postdoctoral).\n\nThe BCCE helps chemistry educators make connections with colleagues and friends who are dedicated to the teaching and learning of chemistry. The conference provides educators with opportunities for interacting with colleagues in formal and informal settings and can be an excellent source for ideas, inspiration, and materials for those both new to chemistry education and those who have years of experience.","URL":"https://conferences.union.wisc.edu/bcce2026/","Location_Country":"USA","Location_City":"Madison, Wisconsin","Location_Instiution":"University of Wisconsin–Madison","Registration Deadline":"","Mode":"In-person"},{"Entry":"7","Type":"Meeting","Start Date":"2025-05-21T00:00:00.000Z","End Date":"2025-05-21T00:00:00.000Z","Title":"Methods in Chemistry Education Research (MICER)","Description":"Methods in Chemistry Education Research (MICER) is an annual meeting focussing on the how to of education research.","URL":"https://micerportal.wordpress.com/","Location_Country":"UK","Location_City":"Edinburgh","Location_Instiution":"Edinburgh Napier University","Registration Deadline":"","Mode":"In-person"},{"Entry":"8","Type":"Conference","Start Date":"2026-06-18T00:00:00.000Z","End Date":"2026-06-19T00:00:00.000Z","Title":"Assessment in Higher Education","Description":"The globally highly-regarded annual Assessment in Higher Education conference will once more welcome delegates to Manchester in 2026.  This event is for both researchers and practitioners alike,  including cutting-edge keynotes by international experts, an interesting range of presentation formats sharing valuable evidence-led research and outstanding practice in parallel strands, energising plenaries as well as practical, pre-conference Masterclass Workshops.\n\nThis forum for critical debate will offer something for everyone interested in improving assessment and feedback as a means of enhancing the student experience, from novice in the field to acknowledged expert.","URL":"https://ahenetwork.org/","Location_Country":"UK","Location_City":"Manchester","Location_Instiution":"AHE Network","Registration Deadline":"","Mode":"In-person"},{"Entry":"9","Type":"Conference","Start Date":"2025-07-16T00:00:00.000Z","End Date":"2025-07-18T00:00:00.000Z","Title":"Improving University Teaching","Description":"In a world increasingly subject to volatility, uncertainty, complexity, and ambiguity (VUCA) the goal of sustainability is aspirational, yet elusive.  A UN report published in 2024 notes that “intensifying, interconnected challenges continue to endanger the realization” of the seventeen sustainable development goals identified by the UN Sustainability Conference twelve years ago in Rio de Janeiro.  This is especially true in education, which the report correctly terms “the bedrock of sustainable development.”   It notes the negative effects of the COVID epidemic, regional conflicts, climate shock, and economic turmoil and paints a picture of a planet struggling to make progress towards them. While the big picture may be less than perfect, there is still much cause for hope, as we strive towards a better future.\n\nAgainst this backdrop, the International Conference on Improving University Teaching seeks to address the challenge of sustainability, equity, and innovation as they affect higher education. In particular, we are exploring how to prepare students for a “VUCA world” in which they will have to contend with multiple challenges, while at the same time ensuring their wellbeing—and that of all academic staff—in the present. By definition, a future subject to uncertainty and ambiguity will require flexibility and adaptability on the part of students.","URL":"https://iutconference.com/","Location_Country":"UK","Location_City":"London","Location_Instiution":"University of Westminster","Registration Deadline":"","Mode":"Hybrid"},{"Entry":"10","Type":"Conference","Start Date":"2025-06-25T00:00:00.000Z","End Date":"2025-06-26T00:00:00.000Z","Title":"Horizons in STEM Higher Education Conference","Description":"Welcome to the 2025 UK Horizons in STEM Higher Education Conference website. This conference is an opportunity for all STEM colleagues to share their insights into teaching innovation and pedagogy and develop connections across the STEM disciplines.\n\nThe spirit of the UK Horizons in STEM Conference has always been one of community, collaboration and collegiality, we value diversity and welcome contributions from a range of STEM educators, including early career academics.","URL":"https://ukstemconference.com/","Location_Country":"UK","Location_City":"Birmingham","Location_Instiution":"Aston University","Registration Deadline":"2025-06-04T00:00:00.000Z","Mode":""},{"Entry":"11","Type":"Conference","Start Date":"2025-12-15T00:00:00.000Z","End Date":"2025-12-20T00:00:00.000Z","Title":"Pacifichem","Description":"The 2025 International Chemical Congress of Pacific Basin Societies will be held  15-20 December 2025. Pacifichem 2025 will be the ninth in the series of successful cosponsored scientific conferences of Pacific Basin Chemical Societies.  Founded in 1984, these conferences have been held in Honolulu, Hawaii about every five years. Education, communication, and translation of chemical knowledge across communities plays a key role in addressing global challenges.  Symposia in chemistry education research and practice, chemistry outreach, pandemic lessons learned, policy making, and knowledge translation through professional practices and educational environments are encouraged.  Topics of interest include, but are not limited to innovative curricula, active learning in the classroom and laboratory, assessment practices, online, synchronous, and asynchronous learning environments, diversity and inclusion, occupational health and safety, intellectual property, entrepreneurism, scientific communication, ethics, and academic integrity.\n\n","URL":"https://pacifichem.org/","Location_Country":"USA","Location_City":"Honolulu, Hawaii","Location_Instiution":"Pacifichem","Registration Deadline":"2025-12-20T00:00:00.000Z","Mode":"In-person"},{"Entry":"12","Type":"Conference","Start Date":"2025-07-06T00:00:00.000Z","End Date":"2025-07-11T00:00:00.000Z","Title":"Chemistry Education Research and Practice (Gordon Research Conference)","Description":"The Chemistry Education Research and Practice GRC is a premier, international scientific conference focused on advancing the frontiers of science through the presentation of cutting-edge and unpublished research, prioritizing time for discussion after each talk and fostering informal interactions among scientists of all career stages. The conference program includes an array of speakers and discussion leaders from institutions and organizations worldwide, concentrating on the latest developments in the field. The conference is five days long and held in a remote location to increase the sense of camaraderie and create scientific communities, with lasting collaborations and friendships. In addition to premier talks, the conference has designated time for poster sessions from individuals of all career stages, and afternoon free time and communal meals allow for informal networking opportunities with leaders in the field.","URL":"https://www.grc.org/chemistry-education-research-and-practice-conference/2025/","Location_Country":"USA","Location_City":"Lewiston, Maine","Location_Instiution":"Gordon Research Conference","Registration Deadline":"","Mode":""},{"Entry":"13","Type":"Conference","Start Date":"2026-08-27T00:00:00.000Z","End Date":"2026-08-28T00:00:00.000Z","Title":"Variety in Chemistry Education / Physics Higher Education Conference (ViCEPHEC)","Description":"INFO TO COME. Variety in Chemistry Education/Physics Higher Education Conference is the UK's leading annual conference for education in the Physical Sciences. Affilliated with both the Institute of Physics and the Royal Society of Chemistry, it is a space for educators to come together as a community and discuss current challenges and share exciting practice.","URL":"","Location_Country":"UK","Location_City":"Nottingham","Location_Instiution":"University of Nottingham","Registration Deadline":"","Mode":"In-person"},{"Entry":"14","Type":"Conference","Start Date":"2025-11-05T00:00:00.000Z","End Date":"2025-11-05T00:00:00.000Z","Title":"Teaching with AI: Early Insights from the New Academic Year","Description":"The Technology Enhanced Learning Team are pleased to announce that the next event in our series of ‘Digitally Enhanced Education webinars’ will take place on Wednesday, the 5th of November from 14:00 – 16:30 (GMT), and will follow the theme 'Teaching with AI: Early Insights from the New Academic Year'","URL":"https://www.kent.ac.uk/whats-on/event/77706/teaching-with-ai-early-insights-from-the-new-academic-year","Location_Country":"UK","Location_City":"Kent","Location_Instiution":"University of Kent","Registration Deadline":"","Mode":"Online"},{"Entry":"15","Type":"Conference","Start Date":"2026-01-08T00:00:00.000Z","End Date":"2026-01-08T00:00:00.000Z","Title":"Chemistry Teaching in Practice","Description":"Building on previous successful meetings, Chemistry Teaching in Practice (CTiP) is a one-day meeting for those working in Chemical Education to discuss topical issues and share best practice. \nIn addition to the keynote address, abstracts are invited on the following topics:\nThe role of practical teaching in a modern undergraduate chemistry course\nAssessment in undergraduate chemistry teaching\nEquality, diversity and inclusion in undergraduate chemistry education\nStudent involvement and engagement in collaborative course development\nThe future of undergraduate chemistry education - Skills and competencies for the next generation of chemists\n","URL":"https://www.rsc.org/events/detail/82524/chemistry-teaching-in-practice","Location_Country":"UK","Location_City":"Nottingham","Location_Instiution":"University of Nottingham","Registration Deadline":"2025-11-14T00:00:00.000Z","Mode":"In-person"},{"Entry":"16","Type":"Conference","Start Date":"2026-04-10T00:00:00.000Z","End Date":"2026-04-10T00:00:00.000Z","Title":"Irish Variety in Chemistry in Education","Description":"The Irish Variety in Chemistry Education meeting is a forum for sharing effective practice in chemistry teaching and related education research in higher education in Ireland and beyond.","URL":"","Location_Country":"Ireland","Location_City":"Maynooth","Location_Instiution":"Maynooth University","Registration Deadline":"","Mode":"In-person"},{"Entry":"17","Type":"Conference","Start Date":"2025-05-27T00:00:00.000Z","End Date":"2025-05-28T00:00:00.000Z","Title":"NTU Annual Learning and Teaching Conference: From Good to Great 2025","Description":"In our environment of rapid change and technological innovations, education should look beyond immediate challenges towards envisioning bold and aspirational futures. This year we invite participants to engage in a speculative and imaginative exploration of new pedagogical possibilities. How might we shape student learning and educational ecosystems to foster deeper societal impact and the broader implications of these changes for equity, sustainability, and global citizenship.  ","URL":"https://www.ntu.edu.sg/education/inspire/CTLP/events-and-outreach/ntu-annual-learning-and-teaching-conference--from-good-to-great-2025","Location_Country":"Singapore","Location_City":"Singapore","Location_Instiution":"Nanyang Technological University","Registration Deadline":"","Mode":"In-person"},{"Entry":"18","Type":"Conference","Start Date":"2026-03-03T00:00:00.000Z","End Date":"2026-03-04T00:00:00.000Z","Title":"#RSCPoster","Description":"#RSCPoster is a free global online poster conference held on LinkedIn over the course of 24 hours. The 2026 edition will take place on 3-4 March 2026. The event brings together the global chemistry community to network with colleagues across the world and at every career stage, share their research and engage in scientific debate.\n\nWe want #RSCPoster to be an inclusive event, connecting researchers from around the world to share and discuss their work. While #RSCPoster takes place on LinkedIn, we are happy for participants to cross-post their posters to engage in discussion with members of the community that use other social media platforms. Prizes will only be awarded based on participation on LinkedIn, so you must share your poster on the platform to be eligible.","URL":"https://www.rsc.org/our-events/about-our-events/rsc-poster","Location_Country":"UK","Location_City":"Online","Location_Instiution":"Royal Society of Chemistry","Registration Deadline":"","Mode":"Online"},{"Entry":"19","Type":"Conference","Start Date":"2026-04-23T00:00:00.000Z","End Date":"2026-04-23T00:00:00.000Z","Title":"Advancing Feedback Practice with GenAI: Pedagogical Challenges and Opportunities","Description":"How can Generative AI meaningfully transform feedback practice in higher education? This one-day conference brings together colleagues who share expertise and interest in enhancing feedback practices and exploring the role of GenAI in shaping approaches to feedback in higher education. ","URL":"https://www.imperial.ac.uk/education-research/our-work/assessment-and-feedback/feedback-and-learning-ai-assisted--reimagined-flair/events/","Location_Country":"UK","Location_City":"London","Location_Instiution":"Imperial College London","Registration Deadline":"","Mode":"In-person"},{"Entry":"20","Type":"Meeting","Start Date":"2026-05-13T00:00:00.000Z","End Date":"2026-05-13T00:00:00.000Z","Title":"MICER 26: Methods in Chemistry Education Research","Description":"We are delighted to announce that Imperial College London will host MICER 26 – Methods in Chemistry Education Research on Wednesday 13 May 2026. MICER is an annual meeting focussing on the ‘how to’ of education research.\n\nThis one-day meeting aims to provide useful and usable information to those working in education about the processes of ‘doing’ educational research. Its purpose is developing capacity in research methods by sharing expertise in an inclusive manner. The majority of the sessions are intended to be active/discussion-based workshops, with plenty of opportunities for support and networking amongst attendees.","URL":"https://micerportal.wordpress.com/","Location_Country":"UK","Location_City":"London","Location_Instiution":"Imperial College London","Registration Deadline":"","Mode":"In-person"}]